In [1]:
import pandas as pd

In [2]:
ser = pd.Series([1,8,52,3.14])
ser

0     1.00
1     8.00
2    52.00
3     3.14
dtype: float64

In [3]:
ser.values
ser.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj = pd.Series([5,3,9,2.52], index=(['a','b','c','d']))
obj

a    5.00
b    3.00
c    9.00
d    2.52
dtype: float64

In [5]:
obj.index
obj.values #almost like a dict object

array([5.  , 3.  , 9.  , 2.52])

In [6]:
obj[['c','d']] #provide a list of index

c    9.00
d    2.52
dtype: float64

In [7]:
obj * 2
import numpy as np
np.exp(obj)

a     148.413159
b      20.085537
c    8103.083928
d      12.428597
dtype: float64

In [8]:
'c' in obj

True

In [9]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj2 = pd.Series(sdata) #creating a Series from dictionary

In [10]:
obj2

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [11]:
states = ['California', 'Ohio', 'Oregon', 'Texas'] #Providing a list to use as index
obj4 = pd.Series(sdata, index=states) #only creates the Series for indexes present in the list
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [12]:
pd.isnull(obj4) 
pd.notnull(obj4) #both methods return Boolean

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [13]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [14]:
obj2 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [15]:
obj4.name = 'Population'
obj4.index.name = 'State'

In [16]:
print(obj4)

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [17]:
obj
obj.index = ['Manu', 'Pavan', 'Uchkya', 'Changya']

In [18]:
obj

Manu       5.00
Pavan      3.00
Uchkya     9.00
Changya    2.52
dtype: float64

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [20]:
pd.DataFrame(data, columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [21]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [22]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [23]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [24]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [25]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [26]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [27]:
frame2['debt'] = 100
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   100
two    2001    Ohio  1.7   100
three  2002    Ohio  3.6   100
four   2001  Nevada  2.4   100
five   2002  Nevada  2.9   100
six    2003  Nevada  3.2   100

In [28]:
frame2['debt'] = np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [29]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2 #assigns the values from Series to DataFrame by matching indexes and inserts NaN for missing values

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [30]:
frame2['eastern'] = frame2['state'] == 'Ohio' #assigning value to non existing column creates a new column
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [31]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [32]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [33]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [34]:
pd.DataFrame(pop,index = ['carrot', 'cabbage', 2001]) #creates DataFrame for provided index list

         Nevada  Ohio
carrot      NaN   NaN
cabbage     NaN   NaN
2001        2.4   1.7

In [35]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [36]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [37]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [38]:
obj3 = pd.Series(['blue','red','yellow'], index = [0,1,2])
obj3

0      blue
1       red
2    yellow
dtype: object

In [39]:
obj4 = obj3.reindex(range(6), method = 'ffill')
obj4

0      blue
1       red
2    yellow
3    yellow
4    yellow
5    yellow
dtype: object

In [40]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3), index = ['a','c','d'], columns = ['ohio','texas','california'])
df1

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8

In [41]:
df2 = df1.reindex(['a','b','c','d'],)
df2

   ohio  texas  california
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [42]:
state = ['california', 'texas', 'Arizona']
df2.reindex(columns = state)

   california  texas  Arizona
a         2.0    1.0      NaN
b         NaN    NaN      NaN
c         5.0    4.0      NaN
d         8.0    7.0      NaN

In [43]:
df2.drop('california', axis = 1)

   ohio  texas
a   0.0    1.0
b   NaN    NaN
c   3.0    4.0
d   6.0    7.0

In [44]:
df2.drop('b', inplace = True) #Drops the row in place and doesn't return any value

In [45]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [46]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [47]:
data.loc[['Colorado'],['one','three']]

          one  three
Colorado    4      6

In [48]:
data.iloc[[1],[0,2]]

          one  three
Colorado    4      6

In [49]:
data.loc[:'Utah',['two','four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11

In [50]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [51]:
data.at['Utah','two']

9

In [52]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [53]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [54]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [55]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])

In [56]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [57]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [58]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [59]:
df2[1,'b'] = np.nan
df2

      a     b     c     d     e  (1, b)
0   0.0   1.0   2.0   3.0   4.0     NaN
1   5.0   6.0   7.0   8.0   9.0     NaN
2  10.0  11.0  12.0  13.0  14.0     NaN
3  15.0  16.0  17.0  18.0  19.0     NaN

In [60]:
df2.drop((1,'b'), axis = 1,inplace = True)
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [61]:
df2.loc[1,'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [62]:
df1.add(df2, fill_value=0) #fill the value wherever missing and then add

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [63]:
df1.reindex(columns = df2.columns, fill_value= 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [64]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]

In [65]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [66]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [67]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [68]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [69]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [70]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.431739  0.213088  1.446519
Ohio    1.381703  0.526079  0.993704
Texas  -0.037113  1.109150  0.182747
Oregon  0.052844 -0.551451  0.452315

In [71]:
frame.apply(lambda x : max(x)- min(x), axis = 'columns')

Utah      1.878258
Ohio      0.855624
Texas     1.146264
Oregon    1.003766
dtype: float64

In [72]:
def f(x):
    return pd.Series([min(x), max(x)], index = ['min','max'])

In [73]:
frame.apply(f, axis = 'columns')

             min       max
Utah   -0.431739  1.446519
Ohio    0.526079  1.381703
Texas  -0.037113  1.109150
Oregon -0.551451  0.452315

In [74]:
myl = [1,2,45,6,5,3,3,2]
list(map((lambda x : '%.2f'%x), (myl)))

['1.00', '2.00', '45.00', '6.00', '5.00', '3.00', '3.00', '2.00']

In [75]:
form = lambda x : ['%.2f'%i for i in x]
form(myl)

['1.00', '2.00', '45.00', '6.00', '5.00', '3.00', '3.00', '2.00']

In [76]:
format = lambda x: '%.2f' % x

In [77]:
frame.applymap(format) #applymap function for DataFrame to apply function element wise

            b      d     e
Utah    -0.43   0.21  1.45
Ohio     1.38   0.53  0.99
Texas   -0.04   1.11  0.18
Oregon   0.05  -0.55  0.45

In [78]:
frame['e'].map(format) #map function for Series

Utah      1.45
Ohio      0.99
Texas     0.18
Oregon    0.45
Name: e, dtype: object

In [79]:
frame

               b         d         e
Utah   -0.431739  0.213088  1.446519
Ohio    1.381703  0.526079  0.993704
Texas  -0.037113  1.109150  0.182747
Oregon  0.052844 -0.551451  0.452315

In [80]:
frame.sort_index() #not in-place

               b         d         e
Ohio    1.381703  0.526079  0.993704
Oregon  0.052844 -0.551451  0.452315
Texas  -0.037113  1.109150  0.182747
Utah   -0.431739  0.213088  1.446519

In [81]:
frame.sort_index(axis = 1, ascending = False)

               e         d         b
Utah    1.446519  0.213088 -0.431739
Ohio    0.993704  0.526079  1.381703
Texas   0.182747  1.109150 -0.037113
Oregon  0.452315 -0.551451  0.052844

In [82]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame.sort_values(by=['b','a'])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [83]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [84]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [85]:
obj[obj.rank()==1]

1   -5
dtype: int64

In [86]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [87]:
objs = pd.Series(np.arange(5), index = ['a','b','b','c','c'])
objs

a    0
b    1
b    2
c    3
c    4
dtype: int32

In [88]:
objs.index.is_unique

False

In [89]:
df = pd.DataFrame(np.arange(12).reshape(3,4), index= ['a','a','b'], columns = ['one','one','two','two'])

In [90]:
df

   one  one  two  two
a    0    1    2    3
a    4    5    6    7
b    8    9   10   11

In [91]:
df.loc['a','one']

   one  one
a    0    1
a    4    5

In [92]:
print(df.sum())
print(df.sum(axis = 'columns'))

one    12
one    15
two    18
two    21
dtype: int64
a     6
a    22
b    38
dtype: int64

In [93]:
obj = pd.Series(['a','a','b','c']*4)
print(obj)

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [94]:
print(obj.describe())
print(obj.min())

count     16
unique     3
top        a
freq       8
dtype: object
a

In [95]:
#conda install pandas-datareader #This installed the additional pandas-datareader package

In [96]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [97]:
print(all_data)

{'AAPL':                   High         Low        Open       Close       Volume  \
Date
2016-03-21   26.912500   26.285000   26.482500   26.477501  142010800.0
2016-03-22   26.822500   26.302500   26.312500   26.680000  129777600.0
2016-03-23   26.767500   26.475000   26.620001   26.532499  102814000.0
2016-03-24   26.562500   26.222500   26.367500   26.417500  104532000.0
2016-03-28   26.547501   26.264999   26.500000   26.297501   77645600.0
...                ...         ...         ...         ...          ...
2021-03-15  124.000000  120.419998  121.410004  123.989998   92403800.0
2021-03-16  127.220001  124.720001  125.699997  125.570000  114740000.0
2021-03-17  125.860001  122.339996  124.050003  124.760002  111437500.0
2021-03-18  123.180000  120.320000  122.879997  120.529999  121229700.0
2021-03-19  121.430000  119.680000  119.900002  119.989998  185023200.0

             Adj Close
Date
2016-03-21   24.626959
2016-03-22   24.815302
2016-03-23   24.678110
2016-03-24   24.571148
2016-03-28   24.459534
...                ...
2021-03-15  123.989998
2021-03-16  125.570000
2021-03-17  124.760002
2021-03-18  120.529999
2021-03-19  119.989998

[1259 rows x 6 columns], 'IBM':                   High         Low        Open       Close     Volume  \
Date
2016-03-21  148.710007  146.720001  147.300003  148.630005  3721600.0
2016-03-22  149.279999  147.839996  148.059998  148.100006  4081900.0
2016-03-23  148.029999  145.130005  148.000000  145.399994  4764200.0
2016-03-24  148.220001  144.490005  144.979996  147.949997  5044500.0
2016-03-28  148.649994  147.229996  147.750000  148.399994  3265100.0
...                ...         ...         ...         ...        ...
2021-03-15  128.750000  127.540001  127.769997  128.580002  3420600.0
2021-03-16  128.520004  127.339996  128.279999  128.240005  4630400.0
2021-03-17  129.490005  127.489998  128.460007  129.029999  4244800.0
2021-03-18  131.000000  127.790001  128.940002  130.059998  5834600.0
2021-03-19  130.440002  128.529999  130.020004  128.899994  9830600.0

             Adj Close
Date
2016-03-21  119.187241
2016-03-22  118.762215
2016-03-23  116.597069
2016-03-24  118.641922
2016-03-28  119.002792
...                ...
2021-03-15  128.580002
2021-03-16  128.240005
2021-03-17  129.029999
2021-03-18  130.059998
2021-03-19  128.899994

[1259 rows x 6 columns], 'MSFT':                   High         Low        Open       Close      Volume  \
Date
2016-03-21   53.930000   52.930000   53.250000   53.860001  23925700.0
2016-03-22   54.250000   53.459999   53.610001   54.070000  23124100.0
2016-03-23   54.240002   53.740002   54.110001   53.970001  20129000.0
2016-03-24   54.330002   53.730000   53.840000   54.209999  19950000.0
2016-03-28   54.290001   53.330002   54.209999   53.540001  17025100.0
...                ...         ...         ...         ...         ...
2021-03-15  235.190002  231.809998  234.960007  234.809998  26034900.0
2021-03-16  240.059998  235.940002  236.279999  237.710007  27717700.0
2021-03-17  238.550003  233.229996  236.149994  237.039993  29500700.0
2021-03-18  234.190002  230.330002  232.559998  230.720001  34833000.0
2021-03-19  232.470001  229.350006  231.020004  230.350006  46410700.0

             Adj Close
Date
2016-03-21   49.388100
2016-03-22   49.580658
2016-03-23   49.488972
2016-03-24   49.709045
2016-03-28   49.094669
...                ...
2021-03-15  234.809998
2021-03-16  237.710007
2021-03-17  237.039993
2021-03-18  230.720001
2021-03-19  230.350006

[1259 rows x 6 columns], 'GOOG':                    High          Low         Open        Close   Volume  \
Date
2016-03-21   742.500000   733.515991   736.500000   742.090027  1836500
2016-03-22   745.000000   737.460022   737.460022   740.750000  1269700
2016-03-23   745.719971   736.150024   742.359985   738.059998  1432100
2016-03-24   737.747009   731.000000   732.010010   735.299988  1594900
2016-03-28   738.989990   732.500000   736.789978   733.530029  1301300
...                 ...          ...          ...          ...      ...
2021-03-15  2067.060059  2043.510010  2062.300049  2066.489990  1298100
2021-03-16  2123.560059  2070.000000  2078.989990  2092.520020  1490600
2021-03-17  2109.780029  2054.000000  2076.030029  2091.080078  1297500
2021-03-18  2075.500000  2033.550049  2061.000000  2036.219971  1361400
2021-03-19  2053.100098  2017.680054  2042.050049  2043.199951  2314400

              Adj Close
Date
2016-03-21   742.090027
2016-03-22   740.750000
2016-03-23   738.059998
2016-03-24   735.299988
2016-03-28   733.530029
...                 ...
2021-03-15  2066.489990
2021-03-16  2092.520020
2021-03-17  2091.080078
2021-03-18  2036.219971
2021-03-19  2043.199951

[1259 rows x 6 columns]}

In [99]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2021-03-15  0.024457  0.007601 -0.003987  0.002216
2021-03-16  0.012743 -0.002644  0.012350  0.012596
2021-03-17 -0.006451  0.006160 -0.002819 -0.000688
2021-03-18 -0.033905  0.007983 -0.026662 -0.026235
2021-03-19 -0.004480 -0.008919 -0.001604  0.003428

In [102]:
print(returns['MSFT'].corr(returns['IBM']))
print(returns['IBM'].corr(returns['MSFT']))

0.5323770902587902
0.5323770902587901

In [105]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.446326  0.712554  0.652137
IBM   0.446326  1.000000  0.532377  0.499969
MSFT  0.712554  0.532377  1.000000  0.779324
GOOG  0.652137  0.499969  0.779324  1.000000

In [106]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000365  0.000140  0.000236  0.000209
IBM   0.000140  0.000268  0.000151  0.000137
MSFT  0.000236  0.000151  0.000301  0.000227
GOOG  0.000209  0.000137  0.000227  0.000281

In [108]:
returns.corrwith(returns.IBM)

AAPL    0.446326
IBM     1.000000
MSFT    0.532377
GOOG    0.499969
dtype: float64

In [109]:
returns.corrwith(volume)

AAPL   -0.073934
IBM    -0.114986
MSFT   -0.084474
GOOG   -0.133995
dtype: float64

In [110]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [117]:
uniques = obj.unique()
uniques.sort() #inplace
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [119]:
pd.value_counts(obj.values, sort=False)

d    1
c    3
b    2
a    3
dtype: int64

In [122]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [123]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [125]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])

In [131]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [129]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                    'Qu2': [2, 3, 1, 2, 3],
                    'Qu3': [1, 5, 2, 4, 4]})

In [136]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [139]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0